In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# id = db.Column("room_id", db.Integer, primary_key=True)
#     room = Column(db.Integer, nullable=False)
#     number_person = Column(db.Integer, nullable=False)
#     type_room = Column(String(250), nullable=False)
#     price_room = Column(db.Integer, nullable=False)
#     position_room = Column(String(250), nullable=False)
#     status_room = Column(String(250), nullable=False)

In [3]:
room = []
for i in range(1,6):
    room+= [k for k in range(i*100+1, 100*i+30)] + [j for j in range(i*100+60,100*i+90)]

In [4]:
df = pd.DataFrame({'room':room})
df['price_room'] = 670
df['numberDomitory'] = 1
df['type_room'] = 'NORM'
df['number_person'] = df['room'].apply(lambda x: 2 if x%2 else 3)
df['gender'] = df['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df['empty_position'] =  df['number_person']
df['status_room'] = 'OK'

In [5]:
df.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,101,670,1,NORM,2,MALE,2,OK
1,102,670,1,NORM,3,FEMALE,3,OK
2,103,670,1,NORM,2,MALE,2,OK
3,104,670,1,NORM,3,FEMALE,3,OK
4,105,670,1,NORM,2,MALE,2,OK

In [6]:
room = []
for i in range(1,6):
    room+= [k for k in range(1000+ i*100+1, 1000+100*i+30)]

In [7]:
df_block = pd.DataFrame({'room':room})
df_block['price_room'] = 1200
df_block['numberDomitory'] = 1
df_block['type_room'] = 'BLOCK'
df_block['number_person'] = 2
df_block['gender'] = df_block['room'].apply(lambda x: 'MALE' if x%2 else 'FEMALE')
df_block['empty_position'] =  df_block['number_person']
df_block['status_room'] = 'OK'

In [8]:
df_block.head()

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
0,1101,1200,1,BLOCK,2,MALE,2,OK
1,1102,1200,1,BLOCK,2,FEMALE,2,OK
2,1103,1200,1,BLOCK,2,MALE,2,OK
3,1104,1200,1,BLOCK,2,FEMALE,2,OK
4,1105,1200,1,BLOCK,2,MALE,2,OK

In [9]:
df = pd.concat([df, df_block])

In [10]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
27,128,670,1,NORM,3,FEMALE,3,OK
96,268,670,1,NORM,3,FEMALE,3,OK
149,362,670,1,NORM,3,FEMALE,3,OK
64,1307,1200,1,BLOCK,2,MALE,2,OK
105,277,670,1,NORM,2,MALE,2,OK
263,528,670,1,NORM,3,FEMALE,3,OK
141,324,670,1,NORM,3,FEMALE,3,OK
101,273,670,1,NORM,2,MALE,2,OK
142,325,670,1,NORM,2,MALE,2,OK
213,467,670,1,NORM,2,MALE,2,OK
11,112,670,1,NORM,3,FEMALE,3,OK
175,388,670,1,NORM,3,FEMALE,3,OK
71,1314,1200,1,BLOCK,2,FEMALE,2,OK
37,1209,1200,1,BLOCK,2,MALE,2,OK
62,1305,1200,1,BLOCK,2,MALE,2,OK
88,260,670,1,NORM,3,FEMALE,3,OK
287,582,670,1,NORM,3,FEMALE,3,OK
201,425,670,1,NORM,2,MALE,2,OK
79,1322,1200,1,BLOCK,2,FEMALE,2,OK
28,129,670,1,NORM,2,MALE,2,OK

In [11]:
df2 = df.copy()
df2['numberDomitory'] = 2
df3 = df.copy()
df3['numberDomitory'] = 3

In [12]:
df = pd.concat([df, df2,df3])

In [13]:
df.sample(20)

,room,price_room,numberDomitory,type_room,number_person,gender,empty_position,status_room
95,267,670,3,NORM,2,MALE,2,OK
21,1122,1200,2,BLOCK,2,FEMALE,2,OK
51,1223,1200,2,BLOCK,2,MALE,2,OK
204,428,670,3,NORM,3,FEMALE,3,OK
160,373,670,1,NORM,2,MALE,2,OK
50,181,670,1,NORM,2,MALE,2,OK
15,116,670,2,NORM,3,FEMALE,3,OK
272,567,670,3,NORM,2,MALE,2,OK
245,510,670,2,NORM,3,FEMALE,3,OK
231,485,670,1,NORM,2,MALE,2,OK
134,1519,1200,3,BLOCK,2,MALE,2,OK
230,484,670,1,NORM,3,FEMALE,3,OK
140,1525,1200,1,BLOCK,2,MALE,2,OK
28,1129,1200,2,BLOCK,2,MALE,2,OK
0,101,670,1,NORM,2,MALE,2,OK
70,1313,1200,1,BLOCK,2,MALE,2,OK
99,1413,1200,2,BLOCK,2,MALE,2,OK
100,272,670,2,NORM,3,FEMALE,3,OK
176,389,670,1,NORM,2,MALE,2,OK
89,1403,1200,2,BLOCK,2,MALE,2,OK

In [16]:
from sqlalchemy import create_engine

disk_engine = create_engine('sqlite:///rooms.sqlite')
df.to_sql(name='rooms', con=disk_engine,if_exists='append',  index=False)

In [15]:
!pip install sqlalchemy

Defaulting to user installation because normal site-packages is not writeable
Collecting sqlalchemy
  Using cached SQLAlchemy-1.3.20-cp38-cp38-manylinux2010_x86_64.whl (1.3 MB)
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.20